# 7--7.1 函数 input() 的工作原理##################################################################
message = '欢迎光临！'
message += "\n请输入你的姓名："
name = input(message)
print('Hello ' + name)
print('7--7.1\n')

# 7.1.2　使用 int() 来获取数值输入################################################################
message = '欢迎光临！'
message += '\n请输入你的年龄：'
age = input(message)
if int(age) < 18:
    print('对不起，你未满十八岁，无法乘坐过山车')
else:
    print('请往前走，乘坐过山车')
print('7--7.1.2\n')

# 7.1.3 求模运算符################################################################################
print('4除3的余数 = ' + str(4 % 3))
print('5除3的余数 = ' + str(5 % 3))
print('6除3的余数 = ' + str(6 % 3))
print('7除3的余数 = ' + str(7 % 3))

#计算你输入的数值是奇数还是偶数
number = input('请输入数字：')
if int(number) % 2 == 0:
    print('您输入的数字'+ str(number) +'是偶数')
else:
    print('您输入的数字'+ str(number) +'是奇数')